{
  "format": "layers-model",
  "generatedBy": "keras v2.3.1",
  "convertedBy": "TensorFlow.js Converter v2.0.1.post1",
  "modelTopology": {
    "keras_version": "2.3.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_17",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_31",
              "trainable": true,
              "batch_input_shape": [
                null,
                14,
                28,
                1
              ],
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_32",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_16",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_31",
              "trainable": true,
              "dtype": "float32",
              "units": 100,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_16",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_32",
              "trainable": true,
              "dtype": "float32",
              "units": 896,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape_15",
              "trainable": true,
              "dtype": "float32",
              "target_shape": [
                4,
                7,
                32
              ]
            }
          },
          {
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "conv2d_transpose_18",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            }
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_6",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wEAAAAAAAAAAQAAAAUAAABDAAAAcxoAAAB8AGQAZACFAmQBZACFAmQAZACFAmYDGQBTACkCTukB\nAAAAqQApAdoBeHICAAAAcgIAAAD6HzxpcHl0aG9uLWlucHV0LTYwLTNkMDUwMjI1N2EzOT7aCDxs\nYW1iZGE+DAAAAHMAAAAA\n",
                null,
                null
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            }
          },
          {
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "conv2d_transpose_19",
              "trainable": true,
              "dtype": "float32",
              "filters": 1,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            }
          }
        ]
      }
    },
    "training_config": {
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "decay": 0.0,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      },
      "loss": "mse",
      "metrics": [],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv2d_31/kernel",
          "shape": [
            3,
            3,
            1,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_31/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_32/kernel",
          "shape": [
            3,
            3,
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_32/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_18/kernel",
          "shape": [
            3,
            3,
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_18/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_19/kernel",
          "shape": [
            3,
            3,
            1,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_19/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_31/kernel",
          "shape": [
            896,
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_31/bias",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_32/kernel",
          "shape": [
            100,
            896
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_32/bias",
          "shape": [
            896
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}